PrzemyslawSwiderski/arduino-playground/drone-cam/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_APP_REPRODUCIBLE_BUILD=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESPP_FILE_SYSTEM_PARTITION_LABEL="storage"
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_TEMP_SENSOR_ENABLE_DEBUG_LOG=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
CONFIG_SPIRAM=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X640_50FPS=y
CONFIG_ESP_VIDEO_ENABLE_SPI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_ISP_PIPELINE_CONTROLLER_TASK_STACK_USE_PSRAM=y
CONFIG_EXAMPLE_SELECT_JPEG_HW_DRIVER=y
